2do Trimestre/Sistema/Sistema/app/Controllers/Mesas.php

SELECT *
FROM `Mesa`
---
    public function index()
    {
        $mesaModel = new MesaModel();
        $data['mesas'] = $mesaModel->findAll();