2do Trimestre/Sistema/app/Controllers/AdminPersonaController.php

UPDATE `Persona` SET `Nom1_usu` = 'Victor', `Nom2_usu` = 'Manuel', `Ape1_usu` = 'Solano', `Ape2_usu` = 'Niño', `Telefono` = '3134890742', `Correo_usu` = 'solanoninov@gmail.com'
WHERE `id_usuario` = '1031422939'
AND `pkfk_Tipo_doc` = '1'
UPDATE `Persona_has_Rol` SET `pkfk_idRol` = '4'
WHERE `pkfk_id_usuario` = '1031422939'
AND `pkfk_Tipo_doc` = '1'
---
    public function actualizar()
    {
        $db = Config::connect();

        // Llaves compuestas originales ocultas en el form para saber a quién actualizar
        $id_original   = $this->request->getPost('id_original');
        $doc_original  = $this->request->getPost('doc_original');

        $id_rol_nuevo  = $this->request->getPost('id_rol');
        $password_new  = $this->request->getPost('Password');

        $datosActualizar = [
            'Nom1_usu'   => $this->request->getPost('Nom1_usu'),
            'Nom2_usu'   => $this->request->getPost('Nom2_usu') ?: null,
            'Ape1_usu'   => $this->request->getPost('Ape1_usu'),
            'Ape2_usu'   => $this->request->getPost('Ape2_usu') ?: null,
            'Telefono'   => $this->request->getPost('Telefono') ?: 0,
            'Correo_usu' => $this->request->getPost('Correo_usu')
        ];

        // Si el admin escribió algo en el campo contraseña, la encriptamos y actualizamos
        if (!empty($password_new)) {
            $datosActualizar['Password'] = password_hash($password_new, PASSWORD_DEFAULT);
        }

        // Ejecutamos update usando la llave compuesta
        $this->personaModel->where('id_usuario', $id_original)
                           ->where('pkfk_Tipo_doc', $doc_original)
                           ->set($datosActualizar)
                           ->update();

        // Actualizamos su rol en la tabla intermedia
        $db->table('Persona_has_Rol')
           ->where('pkfk_id_usuario', $id_original)
           ->where('pkfk_Tipo_doc', $doc_original)
           ->update(['pkfk_idRol' => $id_rol_nuevo]);