2do Trimestre/Sistema/app/Controllers/ClienteQR.php

    public function pantallaPedido()
    {
        $session = session();
        if (!$session->get('logged_in') || $session->get('id_rol') != 4) {
            return redirect()->to(base_url('mesas'));
        }

        $db = \Config\Database::connect();

        $id_pedido = $session->get('id_pedido');

        // Cabecera del pedido (estado, hora, tiempo estimado)
        $pedido = $db->table('Pedido')->where('id_pedido', $id_pedido)->get()->getRowArray();

        // Detalle del pedido cruzado con el menú real
        $items = $db->table('Detalle_Pedido dp')
                    ->select('dp.cantidad, dp.valor_venta, dp.observaciones, m.Productos, m.descripcion')
                    ->join('Menu m', 'm.id_menu = dp.id_menu')
                    ->where('dp.id_pedido', $id_pedido)
                    ->get()->getResultArray();
---
SELECT *
FROM `Pedido`
WHERE `id_pedido` = '12'
SELECT `dp`.`cantidad`, `dp`.`valor_venta`, `dp`.`observaciones`, `m`.`Productos`, `m`.`descripcion`
FROM `Detalle_Pedido` `dp`
JOIN `Menu` `m` ON `m`.`id_menu` = `dp`.`id_menu`
WHERE `dp`.`id_pedido` = '12'

    public function cancelarPedido()
    {
        $session = session();
        $db = \Config\Database::connect();

        $id_mesa = $session->get('id_mesa');

        // Liberamos la mesa (Estado = 0 -> disponible)
        if ($id_mesa) {
            $db->table('Mesa')->where('id_Mesa', $id_mesa)->update(['Estado' => 0]);
---
UPDATE `Mesa` SET `Estado` = 0
WHERE `id_Mesa` = '2'