2do Trimestre/Sistema/app/Controllers/MenuController.php

    public function index()
    {
        if (!session('logueado')) return redirect()->to('/');

        $menuModel = new MenuModel();
        $db = Config::connect();

        // Traemos los productos con su join de categoría
        $datos['productos'] = $menuModel->obtenerProductosConCategoria();

        // Traemos las categorías para cargar el <select> del formulario
        $datos['categorias'] = $db->table('Categoria')->get()->getResultArray();
---
SELECT *
FROM `Categoria`